/*
SQLyog Enterprise v12.08 (64 bit)
MySQL - 5.7.32 : Database - ssm_db
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`ssm_db` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `ssm_db`;

/*Table structure for table `tbl_book` */

DROP TABLE IF EXISTS `tbl_book`;

CREATE TABLE `tbl_book` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `isbn` varchar(32) NOT NULL,
  `book_name` varchar(255) DEFAULT NULL,
  `author` varchar(255) DEFAULT NULL,
  `synopsis` varchar(255) DEFAULT NULL COMMENT '简介',
  `publisher` varchar(255) DEFAULT NULL,
  `publication_date` date DEFAULT NULL,
  `last` int(11) DEFAULT NULL,
  `notes` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  KEY `isbn` (`isbn`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=64 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

/*Data for the table `tbl_book` */

insert  into `tbl_book`(`id`,`isbn`,`book_name`,`author`,`synopsis`,`publisher`,`publication_date`,`last`,`notes`) values (1,'9787229042066','三体全集','刘慈欣','地球往事三部曲','重庆出版社0','2012-01-01',2,'鸡你太美'),(2,'9787108009821','万历十五年','黄仁宇','见微知著，历史观的颠覆','生活·读书·新知三联书店','1997-05-01',3,'见微知著，历史观的颠覆'),(3,'9787200065039','诗经','佚名','思无邪','北京出版社','2006-07-02',5,''),(4,'9787506365437','活着','余华','生的苦难与伟大','作家出版社','2012-08-01',6,NULL),(5,'9787544253994','百年孤独','加西亚·马尔克斯','魔幻现实主义代表作','南海出版公司','2011-06-01',2,NULL),(6,'9787020008728','三国演义','罗贯中','是非成败转头空','人民文学出版社','1998-05-01',3,NULL),(7,'9787020042494','小王子','圣埃克苏佩里','献给长成大人的孩子们','人民文学出版社','2003-08-01',8,NULL),(8,'9787537823425','边城','沈从文','一切都充满了善，然而到处是不凑巧','北岳文艺出版社','2012-01-01',5,'边城==编程'),(10,'9787229042066','三体全集','刘慈欣','地球往事三部曲','重庆出版社','2012-01-01',2,''),(12,'9787200065039','诗经','佚名','思无邪','北京出版社','2006-07-02',5,''),(16,'9787020008728','三国演义','罗贯中','是非成败转头空','人民文学出版社','1998-05-01',3,NULL),(17,'9787020042498','小王子','圣埃克苏佩里','献给长成大人的孩子们','人民文学出版社','2003-08-01',8,NULL),(18,'9787537823425','边城','沈从文','一切都充满了善，然而到处是不凑巧','北岳文艺出版社','2012-01-01',5,'边城==编程'),(21,'9787108009821','万历十五年','黄仁宇','见微知著，历史观的颠覆','生活·读书·新知三联书店','1997-05-01',3,NULL),(41,'9787506365437','活着','余华','生的苦难与伟大','作家出版社','2012-08-01',6,NULL),(43,'9787506365430','活着','余华','生的苦难与伟大','作家出版社','2012-08-01',6,NULL),(45,'9787544253994','百年孤独','加西亚·马尔克斯','魔幻现实主义代表作','南海出版公司','2011-06-01',2,NULL),(46,'9787020008728','三国演义','罗贯中','是非成败转头空','人民文学出版社','1998-05-01',3,NULL),(47,'9787020042494','小王子','圣埃克苏佩里','献给长成大人的孩子们','人民文学出版社','2003-08-01',8,NULL),(48,'9787537823425','边城','沈从文','一切都充满了善，然而到处是不凑巧','北岳文艺出版社','2012-01-01',5,'边城==编程'),(51,'9787544253994','百年孤独','加西亚·马尔克斯','魔幻现实主义代表作','南海出版公司','2011-06-01',2,NULL),(61,'9787108009821','万历十五年','黄仁宇','见微知著，历史观的颠覆','生活·读书·新知三联书店','1997-05-01',3,NULL),(62,'978523333688','web程序设计','你',NULL,'666','2018-03-06',6,NULL),(63,'9000000000000','Java开发','诗经','诗经','诗经','2022-09-01',1,'诗经');

/*Table structure for table `tbl_borrow` */

DROP TABLE IF EXISTS `tbl_borrow`;

CREATE TABLE `tbl_borrow` (
  `isbn_log` varchar(50) NOT NULL,
  `bookname_log` varchar(50) DEFAULT NULL,
  `readerid_log` varchar(50) NOT NULL,
  `readername_log` varchar(50) DEFAULT NULL,
  `cardid_log` varchar(50) DEFAULT NULL,
  `num` int(15) NOT NULL DEFAULT '1',
  `id` int(10) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`) USING BTREE,
  KEY `isbn_log` (`isbn_log`) USING BTREE,
  KEY `readerid_log` (`readerid_log`) USING BTREE,
  CONSTRAINT `isbn_log` FOREIGN KEY (`isbn_log`) REFERENCES `tbl_book` (`isbn`),
  CONSTRAINT `tbl_borrow_ibfk_1` FOREIGN KEY (`readerid_log`) REFERENCES `tbl_reader` (`reader_id`)
) ENGINE=InnoDB AUTO_INCREMENT=138 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

/*Data for the table `tbl_borrow` */

insert  into `tbl_borrow`(`isbn_log`,`bookname_log`,`readerid_log`,`readername_log`,`cardid_log`,`num`,`id`) values ('9787020042494','小王子','202005008','曹操','201001',4,2),('9787020042494','小王子','202005008','曹操','201001',1,3),('9787020042494','小王子','202005008','曹操','201001',1,4),('9000000000000','Java开发','202005008','曹操','201001',8,5),('9787229042066','三体全集','202005002','甄姬','202032',1,18),('9787229042066','三体全集','202005003','诸葛亮','301002',1,19),('9787229042066','三体全集','202005008','曹操','201001',1,20),('9787229042066','三体全集','202005001','周瑜','1010026',1,21),('9787229042066','三体全集','2036526','赵云','260355551',1,22),('9787108009821','万历十五年','202005002','甄姬','202032',1,23),('9787108009821','万历十五年','202005003','诸葛亮','301002',1,24),('9787108009821','万历十五年','202005008','曹操','201001',1,25),('9787108009821','万历十五年','202005001','周瑜','1010026',1,26),('9787108009821','万历十五年','2036526','赵云','260355551',1,27),('9787200065039','诗经','202005002','甄姬','202032',1,28),('9787200065039','诗经','202005003','诸葛亮','301002',1,29),('9787200065039','诗经','202005008','曹操','201001',1,30),('9787200065039','诗经','202005001','周瑜','1010026',1,31),('9787200065039','诗经','2036526','赵云','260355551',1,32),('9787506365437','活着','202005002','甄姬','202032',1,33),('9787506365437','活着','202005003','诸葛亮','301002',1,34),('9787506365437','活着','202005008','曹操','201001',1,35),('9787506365437','活着','202005001','周瑜','1010026',1,36),('9787506365437','活着','2036526','赵云','260355551',1,37),('9787544253994','百年孤独','202005002','甄姬','202032',1,38),('9787544253994','百年孤独','202005003','诸葛亮','301002',1,39),('9787544253994','百年孤独','202005008','曹操','201001',1,40),('9787544253994','百年孤独','202005001','周瑜','1010026',1,41),('9787544253994','百年孤独','2036526','赵云','260355551',1,42),('9787020008728','三国演义','202005002','甄姬','202032',1,43),('9787020008728','三国演义','202005003','诸葛亮','301002',1,44),('9787020008728','三国演义','202005008','曹操','201001',1,45),('9787020008728','三国演义','202005001','周瑜','1010026',1,46),('9787020008728','三国演义','2036526','赵云','260355551',1,47),('9787020042494','小王子','202005002','甄姬','202032',1,48),('9787020042494','小王子','202005003','诸葛亮','301002',1,49),('9787020042494','小王子','202005008','曹操','201001',1,50),('9787020042494','小王子','202005001','周瑜','1010026',1,51),('9787020042494','小王子','2036526','赵云','260355551',1,52),('9787537823425','边城','202005002','甄姬','202032',1,53),('9787537823425','边城','202005003','诸葛亮','301002',1,54),('9787537823425','边城','202005008','曹操','201001',1,55),('9787537823425','边城','202005001','周瑜','1010026',1,56),('9787537823425','边城','2036526','赵云','260355551',1,57),('9787229042066','三体全集','202005002','甄姬','202032',1,58),('9787229042066','三体全集','202005003','诸葛亮','301002',1,59),('9787229042066','三体全集','202005008','曹操','201001',1,60),('9787229042066','三体全集','202005001','周瑜','1010026',1,61),('9787229042066','三体全集','2036526','赵云','260355551',1,62),('9787200065039','诗经','202005002','甄姬','202032',1,63),('9787200065039','诗经','202005003','诸葛亮','301002',1,64),('9787200065039','诗经','202005008','曹操','201001',1,65),('9787200065039','诗经','202005001','周瑜','1010026',1,66),('9787200065039','诗经','2036526','赵云','260355551',1,67),('9787020008728','三国演义','202005002','甄姬','202032',1,68),('9787020008728','三国演义','202005003','诸葛亮','301002',1,69),('9787020008728','三国演义','202005008','曹操','201001',1,70),('9787020008728','三国演义','202005001','周瑜','1010026',1,71),('9787020008728','三国演义','2036526','赵云','260355551',1,72),('9787020042498','小王子','202005002','甄姬','202032',1,73),('9787020042498','小王子','202005003','诸葛亮','301002',1,74),('9787020042498','小王子','202005008','曹操','201001',1,75),('9787020042498','小王子','202005001','周瑜','1010026',1,76),('9787020042498','小王子','2036526','赵云','260355551',1,77),('9787537823425','边城','202005002','甄姬','202032',1,78),('9787537823425','边城','202005003','诸葛亮','301002',1,79),('9787537823425','边城','202005008','曹操','201001',1,80),('9787537823425','边城','202005001','周瑜','1010026',1,81),('9787537823425','边城','2036526','赵云','260355551',1,82),('9787108009821','万历十五年','202005002','甄姬','202032',1,83),('9787108009821','万历十五年','202005003','诸葛亮','301002',1,84),('9787108009821','万历十五年','202005008','曹操','201001',1,85),('9787108009821','万历十五年','202005001','周瑜','1010026',1,86),('9787108009821','万历十五年','2036526','赵云','260355551',1,87),('9787506365437','活着','202005002','甄姬','202032',1,88),('9787506365437','活着','202005003','诸葛亮','301002',1,89),('9787506365437','活着','202005008','曹操','201001',1,90),('9787506365437','活着','202005001','周瑜','1010026',1,91),('9787506365437','活着','2036526','赵云','260355551',1,92),('9787506365430','活着','202005002','甄姬','202032',1,93),('9787506365430','活着','202005003','诸葛亮','301002',1,94),('9787506365430','活着','202005008','曹操','201001',1,95),('9787506365430','活着','202005001','周瑜','1010026',1,96),('9787506365430','活着','2036526','赵云','260355551',1,97),('9787544253994','百年孤独','202005002','甄姬','202032',1,98),('9787544253994','百年孤独','202005003','诸葛亮','301002',1,99),('9787544253994','百年孤独','202005008','曹操','201001',1,100),('9787544253994','百年孤独','202005001','周瑜','1010026',1,101),('9787544253994','百年孤独','2036526','赵云','260355551',1,102),('9787020008728','三国演义','202005002','甄姬','202032',1,103),('9787020008728','三国演义','202005003','诸葛亮','301002',1,104),('9787020008728','三国演义','202005008','曹操','201001',1,105),('9787020008728','三国演义','202005001','周瑜','1010026',1,106),('9787020008728','三国演义','2036526','赵云','260355551',1,107),('9787020042494','小王子','202005002','甄姬','202032',1,108),('9787020042494','小王子','202005003','诸葛亮','301002',1,109),('9787020042494','小王子','202005008','曹操','201001',1,110),('9787020042494','小王子','202005001','周瑜','1010026',1,111),('9787020042494','小王子','2036526','赵云','260355551',1,112),('9787537823425','边城','202005002','甄姬','202032',1,113),('9787537823425','边城','202005003','诸葛亮','301002',1,114),('9787537823425','边城','202005008','曹操','201001',1,115),('9787537823425','边城','202005001','周瑜','1010026',1,116),('9787537823425','边城','2036526','赵云','260355551',1,117),('9787544253994','百年孤独','202005002','甄姬','202032',1,118),('9787544253994','百年孤独','202005003','诸葛亮','301002',1,119),('9787544253994','百年孤独','202005008','曹操','201001',1,120),('9787544253994','百年孤独','202005001','周瑜','1010026',1,121),('9787544253994','百年孤独','2036526','赵云','260355551',1,122),('9787108009821','万历十五年','202005002','甄姬','202032',1,123),('9787108009821','万历十五年','202005003','诸葛亮','301002',1,124),('9787108009821','万历十五年','202005008','曹操','201001',1,125),('9787108009821','万历十五年','202005001','周瑜','1010026',1,126),('9787108009821','万历十五年','2036526','赵云','260355551',1,127),('978523333688','web程序设计','202005002','甄姬','202032',1,128),('978523333688','web程序设计','202005003','诸葛亮','301002',1,129),('978523333688','web程序设计','202005008','曹操','201001',1,130),('978523333688','web程序设计','202005001','周瑜','1010026',1,131),('978523333688','web程序设计','2036526','赵云','260355551',1,132),('9000000000000','Java开发','202005002','甄姬','202032',1,133),('9000000000000','Java开发','202005003','诸葛亮','301002',1,134),('9000000000000','Java开发','202005008','曹操','201001',1,135),('9000000000000','Java开发','202005001','周瑜','1010026',1,136),('9000000000000','Java开发','2036526','赵云','260355551',1,137);

/*Table structure for table `tbl_reader` */

DROP TABLE IF EXISTS `tbl_reader`;

CREATE TABLE `tbl_reader` (
  `id` int(20) NOT NULL AUTO_INCREMENT,
  `reader_id` varchar(32) DEFAULT NULL,
  `reader_name` varchar(20) NOT NULL,
  `card_id` int(32) DEFAULT NULL,
  `education` varchar(20) DEFAULT NULL,
  `create_date` date DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  KEY `reader_id` (`reader_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

/*Data for the table `tbl_reader` */

insert  into `tbl_reader`(`id`,`reader_id`,`reader_name`,`card_id`,`education`,`create_date`) values (2,'202005002','甄姬',202032,'本科','2020-06-09'),(3,'202005003','诸葛亮',301002,'本科','2020-06-09'),(5,'202005008','曹操',201001,'硕士','2020-06-09'),(6,'202005001','周瑜',1010026,'硕士','2020-06-09'),(7,'2036526','赵云',260355551,'高中','2022-09-07');

/*Table structure for table `tbl_user` */

DROP TABLE IF EXISTS `tbl_user`;

CREATE TABLE `tbl_user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user_id` varchar(20) DEFAULT NULL,
  `login_name` varchar(20) DEFAULT NULL,
  `user_name` varchar(20) DEFAULT NULL,
  `password` varchar(20) DEFAULT NULL,
  `status` varchar(11) DEFAULT NULL,
  `create_date` date DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=MyISAM AUTO_INCREMENT=6 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

/*Data for the table `tbl_user` */

insert  into `tbl_user`(`id`,`user_id`,`login_name`,`user_name`,`password`,`status`,`create_date`) values (1,'0001','admin','超级管理员','123456','1','2020-06-08'),(2,'0002','wyj','超级管理员','123456','1','2020-06-08'),(3,'1003','test','编辑人员','123456','3','2020-06-09'),(4,'12','test','超级管理员','123456','1','2020-06-09'),(5,'1004','test','超级管理员','123','2','2020-06-09');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
